app/controllers/time_boxes_controller.rb

SELECT * FROM "time_boxes"
---
  def index
    @time_boxes = TimeBox.all

SELECT * FROM "time_boxes" WHERE ("time_boxes"."id" = 1)
---
  def show
    @time_box = TimeBox.find(params[:id])

INSERT INTO "time_boxes" ("name", "highlights", "created_at", "project_id", "updated_at") VALUES(E'Testy', E'weeeeee was fun', '2010-09-15 04:46:25.784571', 1, '2010-09-15 04:46:25.784571') RETURNING "id"
---
  def create
    @time_box = TimeBox.new(params[:time_box])

    respond_to do |format|
      if @time_box.save